//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
    /*
        int num1, num2;    
        Console.WriteLine("Введите два числа: ");
        num1 = Convert.ToInt32(Console.ReadLine());
        num2 = Convert.ToInt32(Console.ReadLine());
        if (num1 > num2)
        {
            Console.WriteLine("{0} наибольшее число", num1);
            Console.WriteLine("{0} наименьшее число", num2);
        }
        else
        {
            Console.WriteLine("{0} наибольшее число", num2);
            Console.WriteLine("{0} наименьшее число", num1);
        }
        Console.ReadLine();
*/
      

//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.				
/*			
int num1, num2, num3;				
        Console.WriteLine("Введите три числа: ");				
        num1 = Convert.ToInt32(Console.ReadLine());				
        num2 = Convert.ToInt32(Console.ReadLine());				
        num3 = Convert.ToInt32(Console.ReadLine());				
        int max = num1;				
            if (num2 > max);				
        max = num2;				
            if (num3 > max);				
        max = num3;				
        Console.WriteLine("{0} максимальное число", max);				
*/		
