// Задача 1. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
/*
Console.Write("Введите число: ");
string text = Console.ReadLine();
int a = text.Length;
bool x = true;
for (int i = 0; i < a/2; i++)
  {
    if (text [i] != text [a - (i + 1)])
    {
        x = false;
        break;
    }
  }
    if (x)
    {
        Console.WriteLine("{0} это палиндромом", text);
    }
    else
    {
        Console.WriteLine("{0} это не палиндромом", text);
    }
  */
